from flet import *
import asyncio
import sys
sys.setrecursionlimit(1000000)
print("Started or Reloaded...")


from componets.utils import P

from componets.divider import Diivider
from componets.hadith import Hadith

from pages.home import Home
from pages.book import Book

class App(UserControl):
    def __init__(self, page: Page):
        super().__init__()
        self.p = page 
    
    def build(self):
        self.hadith_list = [
            Hadith(
                self.p,
                "عن ولادة رسول الله ص",
                "الْحُسَيْنُ بْنُ مُحَمَّدٍ الاشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ أَبِي الْفَضْلِ عَبْدِ الله بْنِ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ سِنَانٍ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ الثَّانِي (a.s) فَأَجْرَيْتُ اخْتِلافَ الشِّيعَةِ فَقَالَ يَا مُحَمَّدُ إِنَّ الله تَبَارَكَ وَتَعَالَى لَمْ يَزَلْ مُتَفَرِّداً بِوَحْدَانِيَّتِهِ ثُمَّ خَلَقَ مُحَمَّداً وَعَلِيّاً وَفَاطِمَةَ فَمَكَثُوا أَلْفَ دَهْرٍ ثُمَّ خَلَقَ جَمِيعَ الاشْيَاءِ فَأَشْهَدَهُمْ خَلْقَهَا وَأَجْرَى طَاعَتَهُمْ عَلَيْهَا وَفَوَّضَ أُمُورَهَا إِلَيْهِمْ فَهُمْ يُحِلُّونَ مَا يَشَاءُونَ وَيُحَرِّمُونَ مَا يَشَاءُونَ وَلَنْ يَشَاءُوا إِلا أَنْ يَشَاءَ الله تَبَارَكَ وَتَعَالَى ثُمَّ قَالَ يَا مُحَمَّدُ هَذِهِ الدِّيَانَةُ الَّتِي مَنْ تَقَدَّمَهَا مَرَقَ وَمَنْ تَخَلَّفَ عَنْهَا مَحَقَ وَمَنْ لَزِمَهَا لَحِقَ خُذْهَا إِلَيْكَ يَا مُحَمَّدُ.",
                False
            )
            ,
            Hadith(self.p, "كلام غريب",  " قال رسول الله ص: كذات وكذا عن فللن هكذا", True),
            Hadith(self.p, "المنبه", "قال وهب بن منبه: ابي يصحيكم للدوام", False),
        ]
        self._c = Container(
            content=Column(
                controls=self.hadith_list,
                spacing=10,
                scroll=ScrollMode.AUTO,
                auto_scroll=False

            ),

        )
        return P(self._c)

async def main(p: Page):
    p.fonts = {
        'Iran Sans':'fonts/iran-sans-m.ttf'
    }
    p.bgcolor = colors.BLACK54
    p.theme = Theme(
        font_family='Iran Sans'
    )

    p.scroll=ScrollMode.ALWAYS

    views = {
        'home': Home,
        'book': Book,
    }

    home_data = {
        'books':[
            {
                'title':'Al-Kafi',
                'subtext':'hadith book',
                'cover':'images/Al-Kafi.jpg',
                'hadith':[
                    ['1ـ أَخْبَرَنَا مُحَمَّدُ بْنُ يَعْقُوبَ عَنْ عَلِيِّ بْنِ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ أَبِي الْحُسَيْنِ الْفَارِسِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ الله (a.s) قَالَ قَالَ رَسُولُ الله ﷺ طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ أَلا إِنَّ الله يُحِبُّ بُغَاةَ الْعِلْمِ.', False],
                    ['2ـ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الله عَنْ عِيسَى بْنِ عَبْدِ الله الْعُمَرِيِّ عَنْ أَبِي عَبْدِ الله (a.s) قَالَ طَلَبُ الْعِلْمِ فَرِيضَةٌ.', False],
                    ['3ـ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ بَعْضِ أَصْحَابِهِ قَالَ سُئِلَ أَبُو الْحَسَنِ (a.s) هَلْ يَسَعُ النَّاسَ تَرْكُ الْمَسْأَلَةِ عَمَّا يَحْتَاجُونَ إِلَيْهِ فَقَالَ لا.', False],
                    ['4ـ عَلِيُّ بْنُ مُحَمَّدٍ وَغَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ وَمُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي إِسْحَاقَ السَّبِيعِيِّ عَمَّنْ حَدَّثَهُ قَالَ سَمِعْتُ أَمِيرَ الْمُؤْمِنِينَ يَقُولُ أَيُّهَا النَّاسُ اعْلَمُوا أَنَّ كَمَالَ الدِّينِ طَلَبُ الْعِلْمِ وَالْعَمَلُ بِهِ أَلا وَإِنَّ طَلَبَ الْعِلْمِ أَوْجَبُ عَلَيْكُمْ مِنْ طَلَبِ الْمَالِ إِنَّ الْمَالَ مَقْسُومٌ مَضْمُونٌ لَكُمْ قَدْ قَسَمَهُ عَادِلٌ بَيْنَكُمْ وَضَمِنَهُ وَسَيَفِي لَكُمْ وَالْعِلْمُ مَخْزُونٌ عِنْدَ أَهْلِهِ وَقَدْ أُمِرْتُمْ بِطَلَبِهِ مِنْ أَهْلِهِ فَاطْلُبُوهُ.', False],
                    ['5ـ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ الْبَرْقِيِّ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ أَبِي عَبْدِ الله رَجُلٍ مِنْ أَصْحَابِنَا رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ الله (a.s) قَالَ رَسُولُ الله ﷺ طَلَبُ الْعِلْمِ فَرِيضَةٌ وَفِي حَدِيثٍ آخَرَ قَالَ قَالَ أَبُو عَبْدِ الله (a.s) قَالَ رَسُولُ الله ﷺ طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ أَلا وَإِنَّ الله يُحِبُّ بُغَاةَ الْعِلْمِ.', False],
                    ['6ـ عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَبْدِ الله عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (a.s) يَقُولُ تَفَقَّهُوا فِي الدِّينِ فَإِنَّهُ مَنْ لَمْ يَتَفَقَّهْ مِنْكُمْ فِي الدِّينِ فَهُوَ أَعْرَابِيٌّ إِنَّ الله يَقُولُ فِي كِتَابِهِ لِيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنْذِرُوا قَوْمَهُمْ إِذا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ.', False],
                    ['7ـ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ الْقَاسِمِ بْنِ الرَّبِيعِ عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ سَمِعْتُ أَبَا عَبْدِ الله (a.s) يَقُولُ عَلَيْكُمْ بِالتَّفَقُّهِ فِي دِينِ الله وَلا تَكُونُوا أَعْرَاباً فَإِنَّهُ مَنْ لَمْ يَتَفَقَّهْ فِي دِينِ الله لَمْ يَنْظُرِ الله إِلَيْهِ يَوْمَ الْقِيَامَةِ وَلَمْ يُزَكِّ لَهُ عَمَلاً.', False],
                    ['8ـ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ أَبَانِ بْنِ تَغْلِبَ عَنْ أَبِي عَبْدِ الله (a.s) قَالَ لَوَدِدْتُ أَنَّ أَصْحَابِي ضُرِبَتْ رُءُوسُهُمْ بِالسِّيَاطِ حَتَّى يَتَفَقَّهُوا.',True],
                    ['9ـ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ الله (a.s) قَالَ قَالَ لَهُ رَجُلٌ جُعِلْتُ فِدَاكَ رَجُلٌ عَرَفَ هَذَا الامْرَ لَزِمَ بَيْتَهُ وَلَمْ يَتَعَرَّفْ إِلَى أَحَدٍ مِنْ إِخْوَانِهِ قَالَ فَقَالَ كَيْفَ يَتَفَقَّهُ هَذَا فِي دِينِهِ.', False],
                ]
            }
        ]
    }

    Home_view = views.get('home')(p, home_data)
    p.views[0] = (
        View(
            '/',
            controls=[
                Home_view,
            ],
            appbar=Home_view._build_app_bar(),
            scroll=ScrollMode.ALWAYS,
        )
    )

    async def view_pop(view):
        print(view)
        p.views.pop()
        top_view = p.views[-1]
        await p.update_async()
        print('view changed')

    p.on_view_pop = view_pop
    await p.update_async()


if __name__=='__main__':
    loop = asyncio.new_event_loop()
    loop.run_until_complete(
        app_async(
            target=main,
            host="0.0.0.0",
            port=8007,
            assets_dir='assets'
        )
    )
